esp-cpp/espp/components/expressive_eyes/example/sdkconfig.defaults
# ESP32-specific
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESP32S3_DEFAULT_CPU_FREQ_240=y

# Common ESP-related
#
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Flash size
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# PSRAM
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# Default board selection
CONFIG_EXPRESSIVE_EYES_BOARD_ESP_BOX=y

# Default settings
CONFIG_EXPRESSIVE_EYES_AUTO_DEMO=y
CONFIG_EXPRESSIVE_EYES_DEMO_INTERVAL_MS=3000
CONFIG_EXPRESSIVE_EYES_ENABLE_PUPILS=y
CONFIG_EXPRESSIVE_EYES_PUPIL_SIZE=15
CONFIG_EXPRESSIVE_EYES_AUTO_BLINK=y
CONFIG_EXPRESSIVE_EYES_BLINK_INTERVAL_MS=4000
CONFIG_EXPRESSIVE_EYES_EYE_SPACING=100
CONFIG_EXPRESSIVE_EYES_EYE_WIDTH=60
CONFIG_EXPRESSIVE_EYES_EYE_HEIGHT=80
CONFIG_EXPRESSIVE_EYES_COLOR=0xFFFF
